c=60
if c//1000!=0:
    if c%1000!=0:
        r=c%1000
        if r%100!=0:
          print("Банкомат видав "+str(c//1000)+" купюр по 1000 та "+str(r//100)+" купюр по 100 та "+str(r//100)+ " купюр по 10")
        else:
            r=c%1000
            print("Банкомат видав "+str(c//1000)+" купюр по 1000 та "+str(r//100)+" купюр по 100")
    else:print("Банокмат видав "+str(c//1000)+" по 1000")    
else:
    if c//100!=0:
        if c%100!=0:
            r=c%100
            print("Банкомат видав "+str(c//100)+" купюр по 100 та "+str(r//10)+" купюри по 10")
        else:print("Банокмат видав "+str(c//100)+" по 100")
    else:
        if c//10!=0:
            print("Банкомат видав "+str(c//10)+" по 10")
        

    


 
